Repository: rcsarthur/rcsarthur.github.io
Catalog: lib/l10n/intl_*.arb
Languages: pt_br

# locale
source: en_US
pt_br: pt_BR

# appTitle
source: Curriculum Vitae
pt_br: Currículo Vitae

source: Home
pt_br: Início

source: Experiences
pt_br: Experiências

source: Projects
pt_br: Projetos

source: Skills
pt_br: Habilidades

source: Contact
pt_br: Contato

source: Download PDF
pt_br: Baixar PDF

source: Toggle Theme
pt_br: Alternar Tema

source: Change Language
pt_br: Alterar Idioma

# heroTitle
source: Flutter/Dart Developer
pt_br: Desenvolvedor Flutter/Dart

# heroSubtitle
source: Passionate about creating amazing mobile and web applications
pt_br: Apaixonado por criar aplicações mobile e web incríveis

# heroDescription
source: Flutter/Dart developer with experience in mobile, desktop and web development. Expert in Clean Architecture, native state management, REST API integration, internationalization (i18n), theme management and CI/CD.
pt_br: Desenvolvedor Flutter/Dart com experiência em desenvolvimento mobile, desktop e web. Especialista em Clean Architecture, gerenciamento de estado nativo, integração com APIs REST, internacionalização (i18n), gereciamento de temas e CI/CD.

# heroLocale
source: SÃ£o Paulo, SP - Brazil
pt_br: São Paulo, SP - Brasil

source: Contact Me
pt_br: Entre em Contato

source: Main Technologies
pt_br: Principais Tecnologias

# navigateToExperiences
source: View Experiences
pt_br: Ver Experiências

# navigateToProjects
source: View Projects
pt_br: Ver Projetos

# navigateToSkills
source: View Skills
pt_br: Ver Habilidades

source: Professional Experience
pt_br: Experiência Profissional

source: Professional Summary
pt_br: Resumo Profissional

# experienceDescription
source: My professional journey and key achievements
pt_br: Minha jornada profissional e principais conquistas

# currentJob
source: Current
pt_br: Atual

source: Present
pt_br: Presente

source: Technologies
pt_br: Tecnologias

source: Achievements
pt_br: Conquistas

# projectsTitle
source: Projects
pt_br: Projetos

# projectsDescription
source: Main projects developed and their features
pt_br: Principais projetos desenvolvidos e suas funcionalidades

source: Project Details
pt_br: Detalhes do Projeto

source: Description
pt_br: Descrição

source: Features
pt_br: Funcionalidades

source: more features
pt_br: mais funcionalidades

source: View Project
pt_br: Ver Projeto

source: Source Code
pt_br: Código Fonte

source: Go Back
pt_br: Voltar

# skillsTitle
source: Skills
pt_br: Habilidades

# skillsDescription
source: My technical competencies and soft skills
pt_br: Minhas competências técnicas e soft skills

source: Technical Skills
pt_br: Habilidades Técnicas

# skillLevel
source: Level
pt_br: Nível

source: Examples
pt_br: Exemplos

# projectStatusInProgress
source: In Progress
pt_br: Em Desenvolvimento

# projectStatusCompleted
source: Completed
pt_br: Concluído

# projectStatusPaused
source: Paused
pt_br: Pausado

# projectStatusCancelled
source: Cancelled
pt_br: Cancelado

# skillLevelBeginner
source: Beginner
pt_br: Iniciante

# skillLevelIntermediate
source: Intermediate
pt_br: Intermediário

# skillLevelAdvanced
source: Advanced
pt_br: Avançado

# skillLevelExpert
source: Expert
pt_br: Especialista

# skillTypeTechnical
source: Technical
pt_br: Técnica

# skillTypeLanguage
source: Language
pt_br: Idioma

# contactTooltipEmail
source: Send Email
pt_br: Enviar Email

# contactTooltipLinkedin
source: LinkedIn Profile
pt_br: Perfil LinkedIn

# contactTooltipGithub
source: GitHub Profile
pt_br: Perfil GitHub

# errorLoadingData
source: Error loading curriculum data
pt_br: Erro ao carregar dados do currículo

source: Error generating PDF
pt_br: Erro ao gerar PDF

source: Error opening contact
pt_br: Erro ao abrir contato

source: Error changing theme
pt_br: Erro ao alterar tema

source: Error changing language
pt_br: Erro ao alterar idioma

source: Try Again
pt_br: Tentar Novamente

source: Project not found
pt_br: Projeto não encontrado

source: Loading...
pt_br: Carregando...

# noData
source: No data available
pt_br: Nenhum dado disponível

source: more
pt_br: mais

source: Explore
pt_br: Explorar

# emailSubject
source: Contact via GitHub Curriculum
pt_br: Contato via currículo GitHub

# preDefinedMessage
source: Hello, I saw your curriculum and would like to talk.
pt_br: Olá, vi seu currículo e gostaria de conversar.

# experienceHipcomPosition
source: Junior Full-Stack Developer
pt_br: Desenvolvedor Júnior Full-Stack

# experienceHipcomDescription
source: Development of mobile, desktop and web applications using Flutter/Dart, integration with REST APIs, backend development with Java/Quarkus and management of SQLite and MySQL databases.
pt_br: Desenvolvimento de aplicações mobile, desktop e web utilizando Flutter/Dart, integração com APIs REST, desenvolvimento backend com Java/Quarkus e gerenciamento de banco de dados SQLite e MySQL.

# experienceHipcomAchievement1
source: Integration with backend systems using *dio* and *http*
pt_br: Integração com sistemas backend utilizando *dio* e *http*

# experienceHipcomAchievement2
source: Implementation of Clean Architecture
pt_br: Implementação de Clean Architecture

# experienceHipcomAchievement3
source: Application performance optimization by analyzing *Flutter DevTools* in Android Studio (it's horrible to test an app and have the phone heat up in your hand )
pt_br: Otimização de performance de aplicações analizando *Flutter DevTools* no Android Studio (é horrível testar um app e o celular esquentar na mão )

# experienceHipcomAchievement4
source: Cache management using *shared_preferences*
pt_br: Gerenciamento de cache utilizando *shared_preferences*

# experienceHipcomAchievement5
source: State management using MobX and Flutter's native method
pt_br: Gerenciamento de estado utilizando MobX e método nativo do Flutter

# experienceHipcomAchievement6
source: Development of multiple Mobile, Desktop and Web applications using Flutter
pt_br: Desenvolvimento de múltiplas aplicações Mobile, Desktop e Web utilizando Flutter

# experienceHipcomAchievement7
source: Microservices development using Quarkus
pt_br: Desenvolvimento de microsserviços utilizando Quarkus

# experienceHipcomAchievement8
source: REST API development using Dart with the *shelf* lib
pt_br: Desenvolvimento de API REST utilizando Dart com a lib *shelf*

# experienceHipcomAchievement9
source: REST API development to connect apps to MySQL using Quarkus and *jdbc*
pt_br: Desenvolvimento de API REST para conectar os apps ao MySQL utilizando Quarkus e *jdbc*

# experienceHipcomAchievement10
source: Responsive interface development
pt_br: Desenvolvimento de interfaces responsivas

# experienceHipcomAchievement11
source: Unit test development
pt_br: Desenvolvimento de testes unitários

# experienceHipcomAchievement12
source: Implementation of charts and reports using *fl_chart*
pt_br: Implementação de gráficos e relatórios utilizando *fl_chart*

# experienceHipcomAchievement13
source: Implementation of internationalization (i18n) using *flutter_intl* and *flutter_localizations* - Portuguese, English, Spanish and Chinese
pt_br: Implementação de internationalization (i18n) utilizando *flutter_intl* e *flutter_localizations* - Português, Inglês, Espanhol e Chinês

# experienceHipcomAchievement14
source: Implementation of complex calculations with taxes, both in the Front-End and in the Back-End and in MySQL Queries
pt_br: Implementação de cálculos complexos com impostos, tanto no Front-End quanto no Back-End e em Queries MySQL

# experienceHipcomAchievement15
source: Implementation of mobile CI/CD using *codemagic*
pt_br: Implementação de CI/CD mobile utilizando *codemagic*

# experienceHipcomAchievement16
source: Implementation of builds for Desktop using msix and Inno Setup Compiler (the project has not yet been published to the Microsoft Store)
pt_br: Implementação de builds para Desktop utilizando msix e Inno Setup Compiler (o projeto ainda não foi publicado para a Microsoft Store)

# experienceHipcomAchievement17
source: Implementation of Multithreading in Java
pt_br: Implementação de Multithreading em Java

# experienceHipcomAchievement18
source: Implementation of Offline mode using *sqflite*
pt_br: Implementação de modo Offline utilizando *sqflite*

# experienceHipcomAchievement19
source: Implementation of *Isolate* to perform costly tasks in parallel
pt_br: Implementação de *Isolate* para realizar tarefas custosas em paralelo

# experienceHipcomAchievement20
source: Implementation of custom animations
pt_br: Implementação de animações customizadas

# experienceHipcomAchievement21
source: Implementation of exporting zipped logs to Amazon S3 using *logger* lib
pt_br: Implementação de exportação de logs zipados para Amazon S3 utilizando lib *logger*

# experienceHipcomAchievement22
source: Implementation of filters to perform searches in lists
pt_br: Implementação de filtros para realizar buscas em listas

# experienceHipcomAchievement23
source: Implementation of paginated searches: Offset and Cursor
pt_br: Implementação de buscas paginadas: Offset e Cursor

# experienceHipcomAchievement24
source: Implementation of chat with AI (Hippi) using WebSocket
pt_br: Implementação de chat com IA (Hippi) utilizando WebSocket

# experienceHipcomAchievement25
source: Creation of .ps1 script to generate a shortcut on the Windows Desktop for Desktop applications (msix does not do this natively)
pt_br: Criação de script .ps1 para gerar um atalho na Área de Trabalho do Windows para aplicativos Desktop (msix não faz isso nativamente)

# experienceHipcomAchievement26
source: MySQL Query Optimization: optimization of complex queries, reducing execution time, a specific product select was taking more than 1 minute, I reduced the time to less than 20 seconds with the use of batches in Java
pt_br: Otimização de Queries MySQL: otimizações de queries complexas, reduzindo o tempo de execução, um select específico de produtos estava demorando mais de 1 minuto, eu diminuí o tempo para menos de 20 segundos com uso de lotes em Java

# experienceHipcomAchievement27
source: Help in creating the new company website using *Framer*
pt_br: Ajuda na criação do novo site da empresa utilizando *Framer*

# experienceHipcomAchievement28
source: Help with SEO of the new company website
pt_br: Ajuda com SEO do novo site da empresa

# projectBaseDescription
source: Mobile and desktop application for retail management with product control, sales and other reports.
pt_br: Aplicativo mobile e desktop para gestão de varejo com funcionalidades de controle de produtos, vendas e demais relatórios.

# projectBaseFeature1
source: State management using MobX
pt_br: Gerenciamento de estado utilizando MobX

# projectBaseFeature2
source: Singleton management using GetIt
pt_br: Gerenciamento de singletons utilizando GetIt

# projectBaseFeature3
source: Real-time control of crucial data
pt_br: Controle de dados cruciais em tempo real

# projectBaseFeature4
source: Detailed reports
pt_br: Relatórios detalhados

# projectBaseFeature5
source: Responsive interface
pt_br: Interface responsiva

# projectBaseFeature6
source: Offline synchronization
pt_br: Sincronização offline

# projectBaseFeature7
source: Desktop Mode
pt_br: Modo Desktop

# projectBaseFeature8
source: Dark Theme
pt_br: Tema escuro

# projectBaseFeature9
source: Charts and tables
pt_br: Gráficos e tabelas

# projectBaseFeature10
source: Management of different networks for users with several stores
pt_br: Gerenciamento de diferentes redes para usuários com diversas lojas

# projectBaseFeature11
source: Isolated functions for background tasks
pt_br: Funções Isolated para tarefas em background

# projectBaseFeature12
source: Translation to Portuguese, English, Spanish and Chinese
pt_br: Tradução para Português, Inglês, Espanhol e Chinês

# projectBaseFeature13
source: Biometric verification for authentication
pt_br: Verificação biométrica para autenticação

# projectBaseFeature14
source: Automatic login of already authenticated users
pt_br: Login automático de usuários já autenticados

# projectBaseFeature15
source: Registration of sales and purchase goals
pt_br: Registro de metas de vendas e compras

# projectBaseFeature16
source: Integration via WebSocket for HippiAI (Hipcom's artificial intelligence) for questions about graphs available in the app
pt_br: Integração por meio de WebSocket para HippiAI (inteligência artificial da Hipcom) para perguntas sobre gráficos disponíveis no app

# projectComprasDescription
source: Mobile application for managing purchases directly from suppliers with product registration, purchases and reports features.
pt_br: Aplicativo mobile para gestão de compras direto de fornecedores com funcionalidades de cadastro de produtos, compras e relatórios.

# projectComprasFeature2
source: State management using MobX
pt_br: Gerenciamento de estado utilizando MobX

# projectComprasFeature3
source: Singleton management using GetIt
pt_br: Gerenciamento de singletons utilizando GetIt

# projectComprasFeature4
source: Purchase history
pt_br: Histórico de compras

# projectComprasFeature5
source: Product search from filters and in batch
pt_br: Busca de produtos a partir de filtros e em lote

# projectComprasFeature6
source: Product search history
pt_br: Histórico de busca de produtos

# projectComprasFeature7
source: Search and association of suppliers to products
pt_br: Busca e associação de forncedores a produtos

# projectComprasFeature8
source: Synchronization and permanence of offline data
pt_br: Sincronização e permanência de dados offline

# projectComprasFeature9
source: Isolated functions for background tasks
pt_br: Funções Isolated para tarefas em background

# projectComprasFeature10
source: Search by barcode using camera with validation to avoid reading errors
pt_br: Busca por código de barras utilizando câmera com validação para evitar erros de leitura

# projectComprasFeature11
source: Calculation of packaging and final price automatic
pt_br: Cálculo de embalagens e preço final automático

# projectStoreDescription
source: Mobile application for managing other Hipcom apps, allowing you to install, update, remove and open without having to search the device store.
pt_br: Aplicativo mobile para gerenciamento de outros apps da Hipcom, permitindo instalar, atualizar, remover e abrir sem precisar procurar na loja do dispositivo.

# projectStoreFeature1
source: Install, update, remove and open other Hipcom apps
pt_br: Instalar, atualizar, remover e abrir outros apps da Hipcom

# projectStoreFeature3
source: Flutter native state management
pt_br: Gerenciamento de estado nativo do Flutter

# projectStoreApiDescription
source: CLI interface for REST calls from Hipcom Store, communicating with database and Play Store.
pt_br: Interface CLI para chamadas REST do Hipcom Store, comunicando com banco de dados e Play Store.

# projectStoreApiFeature1
source: MVC Architecture
pt_br: Arquitetura MVC

# projectStoreApiFeature2
source: Route authentication using tokens
pt_br: Autenticação de rotas utilizando tokens

# skillFlutterDescription
source: Development of mobile, desktop and web applications with Flutter
pt_br: Desenvolvimento de aplicações mobile, desktop e web com Flutter

# skillFlutterExample1
source: Creation of complex apps with MVVM/Clean Architecture and Clean Code
pt_br: Criação de apps complexos com arquitetura MVVM/Clean Architecture e Clean Code

# skillFlutterExample2
source: Implementation of custom animations
pt_br: Implementação de animações customizadas

# skillFlutterExample3
source: Integration with REST APIs
pt_br: Integração com APIs REST

# skillFlutterExample4
source: Internationalization (i18n)
pt_br: Internacionalização (i18n)

# skillFlutterExample5
source: State management using MobX and Flutter's native method
pt_br: Gerenciamento de estado utilizando MobX e método nativo do Flutter

# skillFlutterExample6
source: Cache management using *shared_preferences*
pt_br: Gerenciamento de cache utilizando *shared_preferences*

# skillFlutterExample7
source: Application performance optimization by analyzing *Flutter DevTools* in Android Studio
pt_br: Otimização de performance de aplicações analizando *Flutter DevTools* no Android Studio

# skillFlutterExample8
source: Implementation of biometric verification for authentication
pt_br: Implementação de verificação biométrica para autenticação

# skillFlutterExample9
source: Implementation of mobile CI/CD using *codemagic*
pt_br: Implementação de CI/CD mobile utilizando *codemagic*

# skillJavaDescription
source: Backend development with Java and Quarkus framework
pt_br: Desenvolvimento backend com Java e framework Quarkus

# skillJavaExample1
source: Creation of REST APIs
pt_br: Criação de APIs REST

# skillJavaExample2
source: Integration with database
pt_br: Integração com banco de dados

# skillJavaExample3
source: Implementation of microservices
pt_br: Implementação de microserviços

# skillJavaExample4
source: Implementation of multithreading
pt_br: Implementação de multithreading

# skillJavaExample5
source: Implementation of unit tests
pt_br: Implementação de testes unitários

# skillJavaExample6
source: Implementation of filters in the endpoint call
pt_br: Implementação de filtros na chamada de endpoints

# skillDatabaseDescription
source: Database management and optimization
pt_br: Gerenciamento e otimização de banco de dados

# skillDatabaseExample1
source: Database schema design
pt_br: Design de esquemas de banco

# skillDatabaseExample2
source: Optimization and creation of complex queries
pt_br: Otimização e criação de queries complexas

# skillDatabaseExample3
source: Database schema migration using *migration* (in MySQL and SQLite)
pt_br: Migração de esquema de banco de dados utilizando *migration* (em MySQL e SQLite)

# skillCicdDescription
source: Automatic application deployment
pt_br: Deploy atutomático de aplicações

# skillCicdExample1
source: Deployment of mobile, desktop and web applications using *codemagic* and *Github Actions*
pt_br: Deploy de aplicações mobile, desktop e web utilizando *codemagic* e *Github Actions*

# skillTeamworkName
source: Teamwork
pt_br: Trabalho em Equipe

# skillTeamworkDescription
source: Effective collaboration in team projects
pt_br: Colaboração efetiva em projetos de equipe

# skillTeamworkExample1
source: Active participation in planning meetings
pt_br: Participação ativa em reuniões de planejamento

# skillTeamworkExample2
source: Mentoring junior developers
pt_br: Mentoria de desenvolvedores júnior

# skillTeamworkExample3
source: Collaborative problem solving
pt_br: Resolução colaborativa de problemas

# skillTeamworkExample4
source: Effective communication with stakeholders
pt_br: Comunicação eficaz com stakeholders

# skillTeamworkExample5
source: Participation in feedback meetings
pt_br: Participação em reuniões de feedback

# skillProblemSolvingName
source: Problem Solving
pt_br: Resolução de Problemas

# skillProblemSolvingDescription
source: Analysis and solution of complex problems
pt_br: Análise e solução de problemas complexos

# skillProblemSolvingExample1
source: Debugging applications in production
pt_br: Debug de aplicações em produção

# skillProblemSolvingExample2
source: Performance optimization
pt_br: Otimização de performance

# skillProblemSolvingExample3
source: Implementation of creative solutions
pt_br: Implementação de soluções criativas

# skillProblemSolvingExample4
source: Answering support calls
pt_br: Atendimento de chamados de suporte

# skillAnalyticalAbilityName
source: Analytical Ability
pt_br: Capacidade Analítica

# skillAnalyticalAbilityDescription
source: Problem prevention and focus on efficient solutions
pt_br: Prevenção de problemas e foco em soluções eficientes

# skillAnalyticalAbilityExample1
source: Analysis of possible problems in the code
pt_br: Análise de possíveis problemas no código

# skillAnalyticalAbilityExample2
source: Refactoring unnecessarily complex code
pt_br: Refatoração de código desnecessariamente complexo

# skillAnalyticalAbilityExample3
source: Detailed requirements analysis to avoid rework or discrepancies in business rules
pt_br: Análise de requisitos detalhada para evitar retrabalho ou divergências nas regras de negócio

# notificationErrorLoadData
source: Error loading curriculum data.
pt_br: Erro ao carregar dados do currículo.

# notificationErrorSelectFilter
source: Error selecting filter.
pt_br: Erro ao selecionar filtro.

# notificationSuccessGeneratePdf
source: PDF generated successfully.
pt_br: PDF gerado com sucesso.

# notificationErrorGeneratePdf
source: Error generating PDF.
pt_br: Erro ao gerar PDF.

# notificationErrorOpenContact
source: Error opening contact: URL not found. ({url})
pt_br: Erro ao abrir contato: URL não encontrada. ({url})

# notificationErrorOpenUrl
source: Error navigating: URL not found. ({url})
pt_br: Erro ao navegar: URL não encontrada. ({url})

# notificationErrorLoadTheme
source: Error loading theme.
pt_br: Erro ao carregar tema.

# notificationSuccessToggleTheme
source: Theme changed to {themeName}.
pt_br: Tema alterado para {themeName}.

# notificationErrorToggleTheme
source: Error changing theme.
pt_br: Erro ao alterar tema.

# notificationSuccessToggleLanguage
source: Idioma alterado para {languageCode}.
pt_br: Language changed to {languageCode}.

# notificationErrorToggleLanguage
source: Error changing language.
pt_br: Erro ao alterar idioma.
